import cv2
from cnocr import CnOcr
from pandas import DataFrame
import pandas as pd
import json
import os
from PIL import Image
import numpy as np
from pyhocon import ConfigFactory
import base64

# from pyhocon import HOCONConverter
# from conf_read import ConfigFileRead

basePath = "."
# config_data = ConfigFactory.parse_file('./cutData.conf')
file_path = basePath + "/result.xlsx"
inPath = basePath + "/data/origin/"
outPath = basePath + "/data/resize"
all_ocr_ = CnOcr()
text_ocr = CnOcr(det_model_name="densenet_lite_136-fc-onnx")  # 所有参数都使用默认值
# text_ocr = CnOcr(det_model_name='naive_det')  # 所有参数都使用默认值
# number_ocr = CnOcr(det_model_name="en_PP-OCRv3_rec_infer.onnx")  # 所有参数都使用默认值
number_ocr = CnOcr(
    det_model_name="en_number_mobile_v2.0_rec_infer.onnx",
    cand_alphabet=[
        "0",
        "1",
        "2",
        "3",
        "4",
        "5",
        "6",
        "7",
        "8",
        "9",
        "|",
        "%",
        ":",
        "",
        " ",
    ],
)  # 所有参数都使用默认值


# 重置分辨率
def cutList(inPaht):
    files = os.listdir(inPaht)
    for index, file in files:
        # 偶数
        if index % 2:
            cut(file[index - 1], file)
            print(1)


cutMap = {
    (1290, 2796, 3): {
        # 1284
        # 图片a 红蓝双方数据偏移
        "offsetX_a": 50.2,
        # 图片b 红蓝双方数据偏移
        "offsetX_b": 41.5,
        # "offsetX_b": 43.5,
        "offsetY_a": 117 / 476 * 100,
        # 图片b 红蓝双方数据偏移
        "offsetY_b": 172 / 828 * 100,
        "offsetY": 13.65,
        "A": [
            {"title": "head", "x": 158, "y": 262, "h": 97, "w": 97},
            {"title": "name", "x": 274, "y": 265, "h": 35, "w": 250},
            {"title": "out", "x": 274, "y": 315, "h": 25, "w": 170},
            {"title": "in", "x": 501, "y": 315, "h": 25, "w": 170},
            {"title": "frequency", "x": 730, "y": 315, "h": 25, "w": 170},
            {"title": "gold", "x": 930, "y": 315, "h": 25, "w": 200},
        ],
        "B": [
            {"title": "kill", "x": 825, "y": 267, "h": 30, "w": 50},
            {"title": "die", "x": 890, "y": 267, "h": 30, "w": 50},
            {"title": "help", "x": 962, "y": 267, "h": 30, "w": 50},
            # {"title": "kill", "x": 805, "y": 267, "h": 30, "w": 50},
            # {"title": "die", "x": 870, "y": 267, "h": 30, "w": 50},
            # {"title": "help", "x": 942, "y": 267, "h": 30, "w": 50},
        ],
        "C": [
            {"title": "gameTime", "x": 480, "y": 70, "h": 30, "w": 200},
            # {"title": "gameTime", "x": 415, "y": 70, "h": 30, "w": 200},
        ],
    },
    (1284, 2778, 3): {
        # 1284
        # 图片a 红蓝双方数据偏移
        "offsetX_a": 50.2,
        # 图片b 红蓝双方数据偏移
        "offsetX_b": 42,
        "offsetY_a": 117 / 476 * 100,
        # 图片b 红蓝双方数据偏移
        "offsetY_b": 172 / 828 * 100,
        "offsetY": 13.65,
        "A": [
            {"title": "head", "x": 158, "y": 262, "h": 97, "w": 97},
            {"title": "name", "x": 274, "y": 265, "h": 35, "w": 200},
            {"title": "out", "x": 274, "y": 315, "h": 25, "w": 170},
            {"title": "in", "x": 501, "y": 315, "h": 25, "w": 170},
            {"title": "frequency", "x": 730, "y": 315, "h": 25, "w": 170},
            {"title": "gold", "x": 940, "y": 315, "h": 25, "w": 200},
            # {"title": "head", "x": 320, "y": 530, "h": 100, "w": 100},
            # {"title": "name", "x": 550, "y": 540, "h": 35, "w": 200},
            # {"title": "out", "x": 750, "y": 640, "h": 45, "w": 170},
            # {"title": "in", "x": 1000, "y": 640, "h": 45, "w": 170},
            # {"title": "frequency", "x": 1240, "y": 640, "h": 45, "w": 170},
            # {"title": "gold", "x": 954, "y": 309, "h": 45, "w": 200},
        ],
        "B": [
            {"title": "kill", "x": 822, "y": 267, "h": 30, "w": 50},
            {"title": "die", "x": 888, "y": 267, "h": 30, "w": 50},
            {"title": "help", "x": 958, "y": 267, "h": 30, "w": 50},
        ],
        "C": [
            {"title": "gameTime", "x": 450, "y": 70, "h": 30, "w": 200},
        ],
    },
    (1280, 2774, 3): {
        # 图片a 红蓝双方数据偏移
        "offsetX_a": 50.2,
        # 图片b 红蓝双方数据偏移
        "offsetX_b": 41,
        "offsetY_a": 117 / 476 * 100,
        # 图片b 红蓝双方数据偏移
        "offsetY_b": 172 / 828 * 100,
        "offsetY": 13.65,
        "A": [
            {"title": "head", "x": 158, "y": 262, "h": 97, "w": 97},
            {"title": "name", "x": 276, "y": 264, "h": 35, "w": 250},
            {"title": "out", "x": 276, "y": 310, "h": 35, "w": 170},
            {"title": "in", "x": 506, "y": 310, "h": 35, "w": 170},
            {"title": "frequency", "x": 725, "y": 310, "h": 35, "w": 170},
            {"title": "gold", "x": 950, "y": 310, "h": 35, "w": 200},
        ],
        "B": [  # 已验证
            {"title": "kill", "x": 835, "y": 263, "h": 35, "w": 50},
            {"title": "die", "x": 902, "y": 263, "h": 35, "w": 45},
            {"title": "help", "x": 965, "y": 263, "h": 35, "w": 45},
            # {"title":'kill',"x":798,"y":263,"h":35,"w":50},
            # {"title":'die' ,"x":865,"y":263,"h":35,"w":45},
            # {"title":'help',"x":930,"y":263,"h":35,"w":45},
        ],
        "C": [  # 已验证
            {"title": "gameTime", "x": 470, "y": 69, "h": 30, "w": 150},
            #  {"title":'gameTime',"x":410,"y":69,"h":30,"w":150},
        ],
    },
    # 0.46220302375809935: {
    #     # 1284
    #     # 图片a 红蓝双方数据偏移
    #     "offsetX_a": 50.2,
    #     # 图片b 红蓝双方数据偏移
    #     "offsetX_b": 42,
    #     "offsetY_a": 117 / 476 * 100,
    #     # 图片b 红蓝双方数据偏移
    #     "offsetY_b": 172 / 828 * 100,
    #     "offsetY": 13.65,
    #     "A": [
    #         {"title": "head", "x": 158, "y": 262, "h": 97, "w": 97},
    #         {
    #             "title": "name",
    #             "x": 103 / 1028 * 100,
    #             "y": 98 / 476 * 100,
    #             "h": 35,
    #             "w": 200,
    #         },
    #         {
    #             "title": "out",
    #             "x": 103 / 1028 * 100,
    #             "y": 117 / 476 * 100,
    #             "h": 25,
    #             "w": 170,
    #         },
    #         {
    #             "title": "in",
    #             "x": 186 / 1028 * 100,
    #             "y": 117 / 476 * 100,
    #             "h": 25,
    #             "w": 170,
    #         },
    #         {
    #             "title": "frequency",
    #             "x": 270 / 1028 * 100,
    #             "y": 117 / 476 * 100,
    #             "h": 25,
    #             "w": 170,
    #         },
    #         {
    #             "title": "gold",
    #             "x": 355 / 1028 * 100,
    #             "y": 117 / 476 * 100,
    #             "h": 25,
    #             "w": 200,
    #         },
    #     ],
    #     "B": [
    #         {"title": "kill", "x": 29.4, "y": 267, "h": 30, "w": 50},
    #         {"title": "die", "x": 32, "y": 267, "h": 30, "w": 45},
    #         {"title": "help", "x": 34.3, "y": 267, "h": 30, "w": 45},
    #     ],
    # },
    (1668, 2388, 3): {
        # 图片a 红蓝双方数据偏移
        "offsetX_a": 50.2,
        # 图片b 红蓝双方数据偏移
        # "offsetX_b": 50,
        "offsetX_b": 46.5,
        "offsetY_a": 117 / 476 * 100,
        # 图片b 红蓝双方数据偏移
        "offsetY_b": 172 / 828 * 100,
        "offsetY": 14.9,
        "A": [
            {"title": "head", "x": 35, "y": 306, "h": 110, "w": 80},
            {"title": "name", "x": 160, "y": 305, "h": 40, "w": 200},
            {"title": "out", "x": 161, "y": 361, "h": 32, "w": 170},
            {"title": "in", "x": 402, "y": 361, "h": 32, "w": 170},
            {"title": "frequency", "x": 643, "y": 361, "h": 32, "w": 170},
            {"title": "gold", "x": 890, "y": 361, "h": 32, "w": 200},
        ],
        "B": [
            {"title": "kill", "x": 650, "y": 307, "h": 40, "w": 50},
            {"title": "die", "x": 733, "y": 307, "h": 40, "w": 45},
            {"title": "help", "x": 799, "y": 307, "h": 40, "w": 45},
        ],
        "C": [
            # {"title": "gameTime", "x": 470, "y": 69, "h": 30, "w": 150},
            {"title": "gameTime", "x": 315, "y": 75, "h": 40, "w": 150},
        ],
    },
    # 2224: {
    #     # 图片a 红蓝双方数据偏移
    #     "offsetX_a": 50.2,
    #     # 图片b 红蓝双方数据偏移
    #     "offsetX_b": 50,
    #     "offsetY_a": 117 / 476 * 100,
    #     # 图片b 红蓝双方数据偏移
    #     "offsetY_b": 172 / 828 * 100,
    #     "offsetY": 14.9,
    #     "A": [
    #         {"title": "head", "x": 34, "y": 305, "h": 110, "w": 80},
    #         {"title": "name", "x": 160, "y": 305, "h": 40, "w": 200},
    #         {"title": "out", "x": 161, "y": 361, "h": 32, "w": 170},
    #         {"title": "in", "x": 402, "y": 361, "h": 32, "w": 170},
    #         {"title": "frequency", "x": 643, "y": 361, "h": 32, "w": 170},
    #         {"title": "gold", "x": 890, "y": 361, "h": 32, "w": 200},
    #     ],
    #     "B": [
    #         {"title": "kill", "x": 650, "y": 307, "h": 40, "w": 50},
    #         {"title": "die", "x": 733, "y": 307, "h": 40, "w": 45},
    #         {"title": "help", "x": 799, "y": 307, "h": 40, "w": 45},
    #     ],
    # },
    (1179, 2556, 3): {
        # 图片a 红蓝双方数据偏移
        "offsetX_a": 50.2,
        # 图片b 红蓝双方数据偏移
        "offsetX_b": 40,  # 已验证
        "offsetY_a": 117 / 476 * 100,
        # 图片b 红蓝双方数据偏移
        "offsetY_b": 172 / 828 * 100,
        "offsetY": 13.65,
        "A": [
            {"title": "head", "x": 144, "y": 240, "h": 100, "w": 100},
            {"title": "name", "x": 252, "y": 241, "h": 40, "w": 200},
            {"title": "out", "x": 252, "y": 290, "h": 32, "w": 170},
            {"title": "in", "x": 464, "y": 290, "h": 32, "w": 170},
            {"title": "frequency", "x": 673, "y": 290, "h": 32, "w": 170},
            {"title": "gold", "x": 890, "y": 290, "h": 32, "w": 200},
        ],
        "B": [
            # 已验证
            {"title": "kill", "x": 770, "y": 244, "h": 40, "w": 50},
            {"title": "die", "x": 838, "y": 244, "h": 40, "w": 50},
            {"title": "help", "x": 899, "y": 244, "h": 40, "w": 50},
        ],
        "C": [
            # 已验证
            {"title": "gameTime", "x": 456, "y": 68, "h": 30, "w": 200},
        ],
    },
    (1170, 2532, 3): {
        # 图片a 红蓝双方数据偏移
        "offsetX_a": 50.2,
        # 图片b 红蓝双方数据偏移
        # "offsetX_b": 41.5,  # 已验证
        "offsetX_b": 43.5,  # 已验证
        "offsetY_a": 117 / 476 * 100,
        # 图片b 红蓝双方数据偏移
        "offsetY_b": 172 / 828 * 100,
        "offsetY": 13.65,
        "A": [
            # 已验证
            {"title": "head", "x": 142, "y": 237, "h": 100, "w": 100},
            {"title": "name", "x": 250, "y": 238, "h": 40, "w": 250},
            {"title": "out", "x": 250, "y": 287, "h": 32, "w": 170},
            {"title": "in", "x": 462, "y": 287, "h": 32, "w": 170},
            {"title": "frequency", "x": 670, "y": 287, "h": 32, "w": 170},
            {"title": "gold", "x": 888, "y": 287, "h": 32, "w": 200},
        ],
        "B": [
            # {"title": "kill", "x": 740, "y": 243, "h": 40, "w": 50},
            # {"title": "die", "x": 810, "y": 243, "h": 40, "w": 50},
            # {"title": "help", "x": 870, "y": 243, "h": 40, "w": 50},
            # 已验证 裁判4/477
            {"title": "kill", "x": 725, "y": 237, "h": 40, "w": 50},
            {"title": "die", "x": 786, "y": 237, "h": 40, "w": 50},
            {"title": "help", "x": 845, "y": 237, "h": 40, "w": 50},
        ],
        "C": [
            # 已验证 裁判4/477
            # {"title": "gameTime", "x": 415, "y": 65, "h": 30, "w": 160},
            {"title": "gameTime", "x": 360, "y": 65, "h": 30, "w": 160},
        ],
    },
    (1080, 2412, 3): {
        # 图片a 红蓝双方数据偏移
        "offsetX_a": 50.2,
        # 图片b 红蓝双方数据偏移
        # "offsetX_b":41.5, #已验证
        "offsetX_b": 43.5,  # 已验证
        "offsetY_a": 117 / 476 * 100,
        # 图片b 红蓝双方数据偏移
        "offsetY_b": 172 / 828 * 100,
        "offsetY": 13.65,
        "A": [
            # 已验证
            {"title": "head", "x": 151, "y": 220, "h": 96, "w": 98},
            {"title": "name", "x": 250, "y": 220, "h": 40, "w": 200},
            {"title": "out", "x": 250, "y": 264, "h": 32, "w": 170},
            {"title": "in", "x": 442, "y": 264, "h": 32, "w": 170},
            {"title": "frequency", "x": 650, "y": 264, "h": 32, "w": 170},
            {"title": "gold", "x": 868, "y": 264, "h": 32, "w": 200},
        ],
        "B": [
            {"title": "kill", "x": 680, "y": 220, "h": 40, "w": 50},
            {"title": "die", "x": 739, "y": 220, "h": 40, "w": 50},
            {"title": "help", "x": 792, "y": 220, "h": 40, "w": 50},
        ],
        "C": [
            {"title": "gameTime", "x": 350, "y": 59, "h": 30, "w": 160},
        ],
    },
    (1084, 2412, 3): {
        # 图片a 红蓝双方数据偏移
        "offsetX_a": 50.2,
        # 图片b 红蓝双方数据偏移
        "offsetX_b": 41.5,  # 已验证
        # "offsetX_b": 43.5,  # 已验证
        "offsetY_a": 117 / 476 * 100,
        # 图片b 红蓝双方数据偏移
        "offsetY_b": 172 / 828 * 100,
        "offsetY": 13.65,
        "A": [
            # 已验证
            {"title": "head", "x": 147, "y": 219, "h": 100, "w": 100},
            {"title": "name", "x": 250, "y": 220, "h": 40, "w": 200},
            {"title": "out", "x": 250, "y": 264, "h": 32, "w": 170},
            {"title": "in", "x": 442, "y": 264, "h": 32, "w": 170},
            {"title": "frequency", "x": 650, "y": 264, "h": 32, "w": 170},
            {"title": "gold", "x": 868, "y": 264, "h": 32, "w": 200},
        ],
        "B": [
            {"title": "kill", "x": 680, "y": 220, "h": 40, "w": 50},
            {"title": "die", "x": 739, "y": 220, "h": 40, "w": 50},
            {"title": "help", "x": 792, "y": 220, "h": 40, "w": 50},
        ],
        "C": [
            {"title": "gameTime", "x": 350, "y": 59, "h": 30, "w": 160},
        ],
    },
    (1080, 2400, 3): {
        # 图片a 红蓝双方数据偏移
        "offsetX_a": 50.2,
        # 图片b 红蓝双方数据偏移
        # "offsetX_b":42, #已验证
        # "offsetX_b":41.5, #已验证
        "offsetX_b": 43.5,  # 已验证
        # "offsetX_b":47, #已验证
        "offsetY_a": 117 / 476 * 100,
        # 图片b 红蓝双方数据偏移
        "offsetY_b": 172 / 828 * 100,
        "offsetY": 13.65,
        "A": [
            # 已验证
            {"title": "head", "x": 146, "y": 219, "h": 100, "w": 100},
            {"title": "name", "x": 245, "y": 220, "h": 40, "w": 250},
            {"title": "out", "x": 245, "y": 264, "h": 32, "w": 170},
            {"title": "in", "x": 442, "y": 264, "h": 32, "w": 170},
            {"title": "frequency", "x": 630, "y": 264, "h": 32, "w": 170},
            {"title": "gold", "x": 828, "y": 264, "h": 32, "w": 200},
        ],
        "B": [
            # {"title": "kill", "x": 700, "y": 220, "h": 40, "w": 50},
            # {"title": "die", "x": 759, "y": 220, "h": 40, "w": 50},
            # {"title": "help", "x": 822, "y": 220, "h": 40, "w": 50},
            {"title": "kill", "x": 680, "y": 220, "h": 40, "w": 50},
            {"title": "die", "x": 739, "y": 220, "h": 40, "w": 50},
            {"title": "help", "x": 792, "y": 220, "h": 40, "w": 50},
            # {"title":'kill',"x":641,"y":220,"h":40,"w":50},
            # {"title":'die' ,"x":690,"y":220,"h":40,"w":50},
            # {"title":'help',"x":750,"y":220,"h":40,"w":50},
        ],
        "C": [  # 1
            #  {"title":'gameTime',"x":370,"y":59,"h":30,"w":160},
            {"title": "gameTime", "x": 330, "y": 59, "h": 30, "w": 160},
            #  {"title":'gameTime',"x":245,"y":57,"h":30,"w":160},
        ],
    },
    (1080, 2376, 3): {
        # 图片a 红蓝双方数据偏移
        "offsetX_a": 50.2,
        # 图片b 红蓝双方数据偏移
        "offsetX_b": 43,  # 已验证
        "offsetY_a": 117 / 476 * 100,
        # 图片b 红蓝双方数据偏移
        "offsetY_b": 172 / 828 * 100,
        "offsetY": 13.65,
        "A": [
            # 已验证
            {"title": "head", "x": 141, "y": 219, "h": 100, "w": 100},
            {"title": "name", "x": 231, "y": 220, "h": 40, "w": 200},
            {"title": "out", "x": 240, "y": 264, "h": 32, "w": 170},
            {"title": "in", "x": 436, "y": 264, "h": 32, "w": 170},
            {"title": "frequency", "x": 620, "y": 264, "h": 32, "w": 170},
            {"title": "gold", "x": 820, "y": 264, "h": 32, "w": 200},
        ],
        "B": [
            # 已验证
            {"title": "kill", "x": 685, "y": 224, "h": 40, "w": 50},
            {"title": "die", "x": 745, "y": 224, "h": 40, "w": 50},
            {"title": "help", "x": 805, "y": 224, "h": 40, "w": 50},
        ],
        "C": [
            # 已验证
            {"title": "gameTime", "x": 345, "y": 61, "h": 30, "w": 160},
        ],
    },
    (1200, 2640, 3): {
        # 图片a 红蓝双方数据偏移
        "offsetX_a": 50.2,
        # 图片b 红蓝双方数据偏移
        "offsetX_b": 41.8,  # 已验证
        "offsetY_a": 117 / 476 * 100,
        # 图片b 红蓝双方数据偏移
        "offsetY_b": 172 / 828 * 100,
        "offsetY": 13.65,
        "A": [
            # 已验证
            {"title": "head", "x": 157, "y": 243, "h": 100, "w": 100},
            {"title": "name", "x": 266, "y": 245, "h": 40, "w": 250},
            {"title": "out", "x": 268, "y": 288, "h": 32, "w": 170},
            {"title": "in", "x": 477, "y": 288, "h": 32, "w": 170},
            {"title": "frequency", "x": 700, "y": 288, "h": 32, "w": 170},
            {"title": "gold", "x": 918, "y": 288, "h": 32, "w": 200},
        ],
        "B": [
            # 已验证
            {"title": "kill", "x": 780, "y": 249, "h": 40, "w": 50},
            {"title": "die", "x": 840, "y": 249, "h": 40, "w": 50},
            {"title": "help", "x": 908, "y": 249, "h": 40, "w": 50},
        ],
        "C": [
            # 已验证
            {"title": "gameTime", "x": 410, "y": 68, "h": 30, "w": 160},
        ],
    },
    (1280, 2769, 3): {
        # 图片a 红蓝双方数据偏移
        "offsetX_a": 50.2,
        # 图片b 红蓝双方数据偏移
        # "offsetX_b": 42,
        "offsetX_b": 43.5,
        "offsetY_a": 117 / 476 * 100,
        # 图片b 红蓝双方数据偏移
        "offsetY_b": 172 / 828 * 100,
        "offsetY": 13.65,
        "A": [
            {"title": "head", "x": 156, "y": 262, "h": 97, "w": 97},
            {"title": "name", "x": 276, "y": 264, "h": 35, "w": 250},
            {"title": "out", "x": 276, "y": 310, "h": 35, "w": 170},
            {"title": "in", "x": 506, "y": 310, "h": 35, "w": 170},
            {"title": "frequency", "x": 725, "y": 310, "h": 35, "w": 170},
            {"title": "gold", "x": 950, "y": 310, "h": 35, "w": 200},
        ],
        "B": [
            # 已验证
            # {"title": "kill", "x": 813, "y": 263, "h": 40, "w": 50},
            # {"title": "die", "x": 875, "y": 263, "h": 40, "w": 50},
            # {"title": "help", "x": 946, "y": 263, "h": 40, "w": 50},
            # 已验证
            {"title": "kill", "x": 790, "y": 263, "h": 40, "w": 50},
            {"title": "die", "x": 855, "y": 263, "h": 40, "w": 50},
            {"title": "help", "x": 926, "y": 263, "h": 40, "w": 50},
        ],
        "C": [
            # 已验证
            # {"title": "gameTime", "x": 443, "y": 71, "h": 30, "w": 150},
            #  {"title":'gameTime',"x":409,"y":71,"h":30,"w":150},
            {"title": "gameTime", "x": 390, "y": 71, "h": 30, "w": 150},
        ],
    },
    (1644, 3840, 3): {
        # 图片a 红蓝双方数据偏移
        "offsetX_a": 50.2,
        # 图片b 红蓝双方数据偏移
        "offsetX_b": 47,
        "offsetY_a": 117 / 476 * 100,
        # 图片b 红蓝双方数据偏移
        "offsetY_b": 172 / 828 * 100,
        "offsetY": 13.65,
        "A": [
            # 已验证
            {"title": "head", "x": 272, "y": 333, "h": 97, "w": 97},
            {"title": "name", "x": 427, "y": 338, "h": 35, "w": 250},
            {"title": "out", "x": 427, "y": 403, "h": 35, "w": 170},
            {"title": "in", "x": 717, "y": 403, "h": 35, "w": 170},
            {"title": "frequency", "x": 1003, "y": 403, "h": 35, "w": 170},
            {"title": "gold", "x": 1308, "y": 403, "h": 35, "w": 200},
        ],
        "B": [
            # 已验证
            {"title": "kill", "x": 1020, "y": 338, "h": 30, "w": 50},
            {"title": "die", "x": 1108, "y": 338, "h": 30, "w": 50},
            {"title": "help", "x": 1200, "y": 338, "h": 30, "w": 50},
        ],
        "C": [
            # 已验证
            {"title": "gameTime", "x": 383, "y": 93, "h": 30, "w": 150},
        ],
    },
    (828, 1792, 3): {
        # 图片a 红蓝双方数据偏移
        "offsetX_a": 50.2,
        # 图片b 红蓝双方数据偏移
        "offsetX_b": 42,  # 已验证
        # "offsetX_b": 43.5,  # 已验证
        "offsetY_a": 117 / 476 * 100,
        # 图片b 红蓝双方数据偏移
        "offsetY_b": 172 / 828 * 100,
        "offsetY": 13.65,
        "A": [  # 已验证
            {"title": "head", "x": 99, "y": 168, "h": 100, "w": 100},
            {"title": "name", "x": 179, "y": 171, "h": 40, "w": 250},
            {"title": "out", "x": 179, "y": 201, "h": 32, "w": 170},
            {"title": "in", "x": 323, "y": 201, "h": 32, "w": 170},
            {"title": "frequency", "x": 474, "y": 201, "h": 32, "w": 170},
            {"title": "gold", "x": 626, "y": 201, "h": 32, "w": 200},
        ],
        "B": [  # 已验证
            {"title": "kill", "x": 527, "y": 170, "h": 40, "w": 50},
            {"title": "die", "x": 567, "y": 170, "h": 40, "w": 50},
            {"title": "help", "x": 608, "y": 170, "h": 40, "w": 50},
            # {"title": "kill", "x": 507, "y": 170, "h": 40, "w": 50},
            # {"title": "die", "x": 547, "y": 170, "h": 40, "w": 50},
            # {"title": "help", "x": 608, "y": 170, "h": 40, "w": 50},
        ],
        "C": [
            # 已验证
            {"title": "gameTime", "x": 280, "y": 47, "h": 30, "w": 160},
            # {"title": "gameTime", "x": 255, "y": 47, "h": 30, "w": 160},
        ],
    },
    (720, 1560, 3): {
        # 图片a 红蓝双方数据偏移
        "offsetX_a": 50.2,
        # 图片b 红蓝双方数据偏移
        "offsetX_b": 43.5,  # 已验证
        "offsetY_a": 117 / 476 * 100,
        # 图片b 红蓝双方数据偏移
        "offsetY_b": 172 / 828 * 100,
        "offsetY": 13.65,
        "A": [  # 已验证
            {"title": "head", "x": 86, "y": 146, "h": 100, "w": 100},
            {"title": "name", "x": 153, "y": 149, "h": 40, "w": 250},
            {"title": "out", "x": 153, "y": 175, "h": 32, "w": 170},
            {"title": "in", "x": 279, "y": 175, "h": 32, "w": 170},
            {"title": "frequency", "x": 411, "y": 175, "h": 32, "w": 170},
            {"title": "gold", "x": 540, "y": 175, "h": 32, "w": 200},
        ],
        "B": [  # 已验证
            {"title": "kill", "x": 443, "y": 148, "h": 40, "w": 50},
            {"title": "die", "x": 482, "y": 148, "h": 40, "w": 50},
            {"title": "help", "x": 517, "y": 148, "h": 40, "w": 50},
        ],
        "C": [
            # 已验证
            {"title": "gameTime", "x": 219, "y": 41, "h": 30, "w": 160},
        ],
    },
    (1104, 2376, 3): {
        # 图片a 红蓝双方数据偏移
        "offsetX_a": 50.2,
        # 图片b 红蓝双方数据偏移
        # "offsetX_b":41.5, #已验证
        "offsetX_b": 42,  # 已验证
        "offsetY_a": 117 / 476 * 100,
        # 图片b 红蓝双方数据偏移
        "offsetY_b": 172 / 828 * 100,
        "offsetY": 13.65,
        "A": [
            {"title": "head", "x": 131, "y": 225, "h": 100, "w": 100},
            {"title": "name", "x": 227, "y": 225, "h": 40, "w": 200},
            {"title": "out", "x": 233, "y": 268, "h": 32, "w": 170},
            {"title": "in", "x": 425, "y": 268, "h": 32, "w": 170},
            {"title": "frequency", "x": 626, "y": 268, "h": 32, "w": 170},
            {"title": "gold", "x": 825, "y": 268, "h": 32, "w": 200},
        ],
        "B": [
            {"title": "kill", "x": 693, "y": 228, "h": 40, "w": 50},
            {"title": "die", "x": 755, "y": 228, "h": 40, "w": 50},
            {"title": "help", "x": 814, "y": 228, "h": 40, "w": 50},
        ],
        "C": [
            {"title": "gameTime", "x": 366, "y": 63, "h": 30, "w": 160},
        ],
    },
    (1440, 3200, 3): {
        # 图片a 红蓝双方数据偏移
        "offsetX_a": 50.2,
        # 图片b 红蓝双方数据偏移
        "offsetX_b": 43.5,
        "offsetY_a": 117 / 476 * 100,
        # 图片b 红蓝双方数据偏移
        "offsetY_b": 172 / 828 * 100,
        "offsetY": 13.65,
        "A": [
            {"title": "head", "x": 197, "y": 287, "h": 100, "w": 100},
            {"title": "name", "x": 320, "y": 297, "h": 35, "w": 250},
            {"title": "out", "x": 320, "y": 345, "h": 35, "w": 170},
            {"title": "in", "x": 588, "y": 345, "h": 35, "w": 170},
            {"title": "frequency", "x": 844, "y": 345, "h": 35, "w": 170},
            {"title": "gold", "x": 1103, "y": 345, "h": 35, "w": 200},
        ],
        "B": [
            {"title": "kill", "x": 920, "y": 300, "h": 30, "w": 50},
            {"title": "die", "x": 993, "y": 300, "h": 30, "w": 50},
            {"title": "help", "x": 1068, "y": 300, "h": 30, "w": 50},
        ],
        "C": [
            {"title": "gameTime", "x": 460, "y": 78, "h": 30, "w": 150},
        ],
    },
    (1242, 2688, 3): {
        # 图片a 红蓝双方数据偏移
        "offsetX_a": 50.2,
        # 图片b 红蓝双方数据偏移
        "offsetX_b": 44,
        "offsetY_a": 117 / 476 * 100,
        # 图片b 红蓝双方数据偏移
        "offsetY_b": 172 / 828 * 100,
        "offsetY": 13.65,
        "A": [  # 1
            {"title": "head", "x": 150, "y": 253, "h": 97, "w": 97},
            {"title": "name", "x": 264, "y": 255, "h": 35, "w": 200},
            {"title": "out", "x": 264, "y": 305, "h": 25, "w": 170},
            {"title": "in", "x": 491, "y": 305, "h": 25, "w": 170},
            {"title": "frequency", "x": 710, "y": 305, "h": 25, "w": 170},
            {"title": "gold", "x": 930, "y": 305, "h": 25, "w": 200},
        ],
        "B": [  # 1
            {"title": "kill", "x": 770, "y": 257, "h": 30, "w": 50},
            {"title": "die", "x": 820, "y": 257, "h": 30, "w": 50},
            {"title": "help", "x": 890, "y": 257, "h": 30, "w": 50},
        ],
        "C": [  # 1
            {"title": "gameTime", "x": 380, "y": 68, "h": 30, "w": 150},
        ],
    },
    (1242, 2208, 3): {
        # 图片a 红蓝双方数据偏移
        "offsetX_a": 46.5,
        # 图片b 红蓝双方数据偏移
        "offsetX_b": 44,
        "offsetY_a": 117 / 476 * 100,
        # 图片b 红蓝双方数据偏移
        "offsetY_b": 172 / 828 * 100,
        "offsetY": 13.65,
        "A": [  # 1
            {"title": "head", "x": 150 * 0.89, "y": 240, "h": 150, "w": 120},
            {"title": "name", "x": 272, "y": 255, "h": 45, "w": 200},
            {"title": "out", "x": 264, "y": 305, "h": 45, "w": 170},
            {"title": "in", "x": 491, "y": 305, "h": 45, "w": 170},
            {"title": "frequency", "x": 710, "y": 305, "h": 45, "w": 170},
            {"title": "gold", "x": 930, "y": 305, "h": 45, "w": 200},
        ],
        "B": [  # 1
            {"title": "kill", "x": 770 * 0.87, "y": 257, "h": 30, "w": 50},
            {"title": "die", "x": 820 * 0.87, "y": 257, "h": 30, "w": 50},
            {"title": "help", "x": 890 * 0.87, "y": 257, "h": 30, "w": 50},
        ],
        "C": [  # 1
            {"title": "gameTime", "x": 380 * 0.82, "y": 68, "h": 30, "w": 150},
        ],
    },
    (1125, 2436, 3): {
        # 图片a 红蓝双方数据偏移
        "offsetX_a": 50.2,
        # 图片b 红蓝双方数据偏移
        "offsetX_b": 42.5,  # 已验证
        # "offsetX_b":43, #已验证
        "offsetY_a": 117 / 476 * 100,
        # 图片b 红蓝双方数据偏移
        "offsetY_b": 172 / 828 * 100,
        "offsetY": 13.65,
        "A": [
            # 已验证
            {"title": "head", "x": 137, "y": 229, "h": 100, "w": 100},
            {"title": "name", "x": 240, "y": 228, "h": 40, "w": 250},
            {"title": "out", "x": 240, "y": 277, "h": 32, "w": 170},
            {"title": "in", "x": 442, "y": 277, "h": 32, "w": 170},
            {"title": "frequency", "x": 640, "y": 277, "h": 32, "w": 170},
            {"title": "gold", "x": 848, "y": 277, "h": 32, "w": 200},
        ],
        "B": [
            {"title": "kill", "x": 710, "y": 225, "h": 40, "w": 50},
            {"title": "die", "x": 770, "y": 225, "h": 40, "w": 50},
            {"title": "help", "x": 825, "y": 225, "h": 40, "w": 50},
        ],
        "C": [  # 1
            {"title": "gameTime", "x": 370, "y": 62, "h": 30, "w": 160},
            # {"title": "gameTime", "x": 350, "y": 62, "h": 30, "w": 160},
        ],
    },
    (1220, 2712, 3): {
        # 图片a 红蓝双方数据偏移
        "offsetX_a": 50.2,
        # 图片b 红蓝双方数据偏移
        # "offsetX_b": 41,
        "offsetX_b": 44,
        "offsetY_a": 117 / 476 * 100,
        # 图片b 红蓝双方数据偏移
        "offsetY_b": 172 / 828 * 100,
        "offsetY": 13.65,
        "A": [
            {"title": "head", "x": 168, "y": 245, "h": 97, "w": 97},
            {"title": "name", "x": 276, "y": 250, "h": 35, "w": 250},
            {"title": "out", "x": 276, "y": 290, "h": 35, "w": 170},
            {"title": "in", "x": 506, "y": 290, "h": 35, "w": 170},
            {"title": "frequency", "x": 705, "y": 290, "h": 35, "w": 170},
            {"title": "gold", "x": 940, "y": 290, "h": 35, "w": 200},
        ],
        "B": [  # 已验证
            {"title": "kill", "x": 765, "y": 254, "h": 35, "w": 50},
            {"title": "die", "x": 830, "y": 254, "h": 35, "w": 45},
            {"title": "help", "x": 905, "y": 254, "h": 35, "w": 45},
        ],
        "C": [  # 已验证
            {"title": "gameTime", "x": 374, "y": 65, "h": 30, "w": 150},
        ],
    },
    (1212, 2616, 3): {
        # 图片a 红蓝双方数据偏移
        "offsetX_a": 50.2,
        # 图片b 红蓝双方数据偏移
        # "offsetX_b":41,
        "offsetX_b": 43.5,
        "offsetY_a": 117 / 476 * 100,
        # 图片b 红蓝双方数据偏移
        "offsetY_b": 172 / 828 * 100,
        "offsetY": 13.65,
        "A": [
            {"title": "head", "x": 145, "y": 247, "h": 100, "w": 100},
            {"title": "name", "x": 261, "y": 245, "h": 35, "w": 250},
            {"title": "out", "x": 261, "y": 295, "h": 35, "w": 170},
            {"title": "in", "x": 470, "y": 295, "h": 35, "w": 170},
            {"title": "frequency", "x": 690, "y": 295, "h": 35, "w": 170},
            {"title": "gold", "x": 915, "y": 295, "h": 35, "w": 200},
        ],
        "B": [
            {"title": "kill", "x": 750, "y": 250, "h": 40, "w": 50},
            {"title": "die", "x": 815, "y": 250, "h": 40, "w": 50},
            {"title": "help", "x": 883, "y": 250, "h": 40, "w": 50},
        ],
        "C": [
            {"title": "gameTime", "x": 380, "y": 65, "h": 30, "w": 150},
        ],
    },
    (1260, 2800, 3): {
        # 图片a 红蓝双方数据偏移
        "offsetX_a": 50.2,
        # 图片b 红蓝双方数据偏移
        "offsetX_b": 43.5,
        "offsetY_a": 117 / 476 * 100,
        # 图片b 红蓝双方数据偏移
        "offsetY_b": 172 / 828 * 100,
        "offsetY": 13.65,
        "A": [
            # 已验证
            {"title": "head", "x": 173, "y": 252, "h": 97, "w": 97},
            {"title": "name", "x": 286, "y": 260, "h": 35, "w": 250},
            {"title": "out", "x": 286, "y": 306, "h": 35, "w": 170},
            {"title": "in", "x": 516, "y": 306, "h": 35, "w": 170},
            {"title": "frequency", "x": 740, "y": 306, "h": 35, "w": 170},
            {"title": "gold", "x": 967, "y": 306, "h": 35, "w": 200},
        ],
        "B": [  # 已验证
            {"title": "kill", "x": 805, "y": 260, "h": 35, "w": 50},
            {"title": "die", "x": 870, "y": 260, "h": 35, "w": 45},
            {"title": "help", "x": 941, "y": 260, "h": 35, "w": 45},
        ],
        "C": [  # 已验证
            {"title": "gameTime", "x": 397, "y": 67, "h": 30, "w": 150},
        ],
    },
    (1440, 3168, 3): {
        # 图片a 红蓝双方数据偏移
        "offsetX_a": 50.2,
        # 图片b 红蓝双方数据偏移
        "offsetX_b": 43.5,
        "offsetY_a": 117 / 476 * 100,
        # 图片b 红蓝双方数据偏移
        "offsetY_b": 172 / 828 * 100,
        "offsetY": 13.65,
        "A": [
            {"title": "head", "x": 197, "y": 287, "h": 100, "w": 100},
            {"title": "name", "x": 320, "y": 297, "h": 35, "w": 250},
            {"title": "out", "x": 320, "y": 345, "h": 35, "w": 170},
            {"title": "in", "x": 588, "y": 345, "h": 35, "w": 170},
            {"title": "frequency", "x": 844, "y": 345, "h": 35, "w": 170},
            {"title": "gold", "x": 1103, "y": 345, "h": 35, "w": 200},
        ],
        "B": [
            {"title": "kill", "x": 920, "y": 300, "h": 30, "w": 50},
            {"title": "die", "x": 993, "y": 300, "h": 30, "w": 50},
            {"title": "help", "x": 1068, "y": 300, "h": 30, "w": 50},
        ],
        "C": [
            {"title": "gameTime", "x": 450, "y": 78, "h": 30, "w": 150},
        ],
    },
    (1080, 2256, 3): {
        # 图片a 红蓝双方数据偏移
        "offsetX_a": 50.2,
        # 图片b 红蓝双方数据偏移
        "offsetX_b": 47,  # 已验证
        "offsetY_a": 117 / 476 * 100,
        # 图片b 红蓝双方数据偏移
        "offsetY_b": 172 / 828 * 100,
        "offsetY": 13.65,
        "A": [
            # 已验证
            {"title": "head", "x": 112, "y": 220, "h": 100, "w": 100},
            {"title": "name", "x": 208, "y": 220, "h": 40, "w": 200},
            {"title": "out", "x": 208, "y": 260, "h": 32, "w": 170},
            {"title": "in", "x": 402, "y": 260, "h": 32, "w": 170},
            {"title": "frequency", "x": 596, "y": 260, "h": 32, "w": 170},
            {"title": "gold", "x": 790, "y": 260, "h": 32, "w": 200},
        ],
        "B": [
            # 已验证
            {"title": "kill", "x": 605, "y": 224, "h": 40, "w": 50},
            {"title": "die", "x": 665, "y": 224, "h": 40, "w": 50},
            {"title": "help", "x": 722, "y": 224, "h": 40, "w": 50},
        ],
        "C": [
            # 已验证
            {"title": "gameTime", "x": 255, "y": 62, "h": 30, "w": 160},
        ],
    },
    (1080, 2340, 3): {
        # 图片a 红蓝双方数据偏移
        "offsetX_a": 50.2,
        # 图片b 红蓝双方数据偏移
        # "offsetX_b":46, #已验证
        "offsetX_b":47, #已验证
        # "offsetX_b": 43.5,  # 已验证
        "offsetY_a": 117 / 476 * 100,
        # 图片b 红蓝双方数据偏移
        "offsetY_b": 172 / 828 * 100,
        "offsetY": 13.65,
        "A": [
            # 已验证
            # {"title": "head", "x":112, "y":220, "h": 100, "w": 100},
            # {"title":'name',"x":208,"y":220,"h":40,"w":200},
            # {"title":'out',"x":208,"y":260,"h":32,"w":170},
            # {"title":'in',"x":402,"y": 260,"h":32,"w":170},
            # {"title":'frequency',"x":596,"y":260,"h":32,"w":170},
            # {"title":'gold',"x":790,"y":260,"h":32,"w":200}
            {"title": "head", "x": 132, "y": 220, "h": 100, "w": 100},
            {"title": "name", "x": 228, "y": 220, "h": 40, "w": 200},
            {"title": "out", "x": 228, "y": 260, "h": 32, "w": 170},
            {"title": "in", "x": 402, "y": 260, "h": 32, "w": 170},
            {"title": "frequency", "x": 596, "y": 260, "h": 32, "w": 170},
            {"title": "gold", "x": 790, "y": 260, "h": 32, "w": 200},
        ],
        "B": [
            # 已验证
            {"title":'kill',"x":625,"y":224,"h":40,"w":50},
            {"title":'die' ,"x":685,"y":224,"h":40,"w":50},
            {"title":'help',"x":742,"y":224,"h":40,"w":50},
            # {"title":'kill',"x":605,"y":224,"h":40,"w":50},
            # {"title":'die' ,"x":665,"y":224,"h":40,"w":50},
            # {"title":'help',"x":722,"y":224,"h":40,"w":50},
            # {"title": "kill", "x": 665, "y": 224, "h": 40, "w": 50},
            # {"title": "die", "x": 725, "y": 224, "h": 40, "w": 50},
            # {"title": "help", "x": 782, "y": 224, "h": 40, "w": 50},
        ],
        "C": [
            # 已验证
             {"title":'gameTime',"x":255,"y":62,"h":30,"w":160},
            # {"title": "gameTime", "x": 350, "y": 62, "h": 30, "w": 160},
        ],
    },
    (1228, 2700, 3): {
        # 图片a 红蓝双方数据偏移
        "offsetX_a": 50.2,
        # 图片b 红蓝双方数据偏移
        "offsetX_b": 43.5,
        "offsetY_a": 117 / 476 * 100,
        # 图片b 红蓝双方数据偏移
        "offsetY_b": 172 / 828 * 100,
        "offsetY": 13.65,
        "A": [
            # 已验证
            {"title": "head", "x": 158, "y": 262, "h": 97, "w": 97},
            {"title": "name", "x": 276, "y": 264, "h": 35, "w": 250},
            {"title": "out", "x": 276, "y": 310, "h": 35, "w": 170},
            {"title": "in", "x": 506, "y": 310, "h": 35, "w": 170},
            {"title": "frequency", "x": 725, "y": 310, "h": 35, "w": 170},
            {"title": "gold", "x": 940, "y": 310, "h": 35, "w": 200},
        ],
        "B": [  # 已验证
            {"title": "kill", "x": 765, "y": 254, "h": 35, "w": 50},
            {"title": "die", "x": 830, "y": 254, "h": 35, "w": 45},
            {"title": "help", "x": 905, "y": 254, "h": 35, "w": 45},
        ],
        "C": [  # 已验证
            {"title": "gameTime", "x": 390, "y": 65, "h": 30, "w": 150},
        ],
    },
    (1220, 2700, 3): {
        # 图片a 红蓝双方数据偏移
        "offsetX_a": 50.2,
        # 图片b 红蓝双方数据偏移
        "offsetX_b": 43.5,
        "offsetY_a": 117 / 476 * 100,
        # 图片b 红蓝双方数据偏移
        "offsetY_b": 172 / 828 * 100,
        "offsetY": 13.65,
        "A": [
            # 已验证
            {"title": "head", "x": 164, "y": 248, "h": 97, "w": 97},
            {"title": "name", "x": 276, "y": 251, "h": 35, "w": 250},
            {"title": "out", "x": 276, "y": 296, "h": 35, "w": 170},
            {"title": "in", "x": 496, "y": 296, "h": 35, "w": 170},
            {"title": "frequency", "x": 715, "y": 296, "h": 35, "w": 170},
            {"title": "gold", "x": 930, "y": 296, "h": 35, "w": 200},
        ],
        "B": [  # 已验证
            {"title": "kill", "x": 765, "y": 254, "h": 35, "w": 50},
            {"title": "die", "x": 830, "y": 254, "h": 35, "w": 45},
            {"title": "help", "x": 905, "y": 254, "h": 35, "w": 45},
        ],
        "C": [  # 已验证
            {"title": "gameTime", "x": 390, "y": 65, "h": 30, "w": 150},
        ],
    },
    (1080, 2460, 3): {
        # 图片a 红蓝双方数据偏移
        "offsetX_a": 50.2,
        # 图片b 红蓝双方数据偏移
        # "offsetX_b":41.5, #已验证
        "offsetX_b": 47,  # 已验证
        "offsetY_a": 117 / 476 * 100,
        # 图片b 红蓝双方数据偏移
        "offsetY_b": 172 / 828 * 100,
        "offsetY": 13.65,
        "A": [
            # 已验证
            {"title": "head", "x": 163, "y": 217, "h": 100, "w": 100},
            {"title": "name", "x": 252, "y": 220, "h": 40, "w": 250},
            {"title": "out", "x": 252, "y": 264, "h": 32, "w": 170},
            {"title": "in", "x": 442, "y": 264, "h": 32, "w": 170},
            {"title": "frequency", "x": 630, "y": 264, "h": 32, "w": 170},
            {"title": "gold", "x": 835, "y": 264, "h": 32, "w": 200},
        ],
        "B": [
            # {"title":'kill',"x":680,"y":220,"h":40,"w":50},
            # {"title":'die' ,"x":739,"y":220,"h":40,"w":50},
            # {"title":'help',"x":792,"y":220,"h":40,"w":50},
            {"title": "kill", "x": 655, "y": 220, "h": 40, "w": 50},
            {"title": "die", "x": 710, "y": 220, "h": 40, "w": 50},
            {"title": "help", "x": 773, "y": 220, "h": 40, "w": 50},
        ],
        "C": [  # 1
            #  {"title":'gameTime',"x":330,"y":59,"h":30,"w":160},
            {"title": "gameTime", "x": 252, "y": 57, "h": 30, "w": 160},
        ],
    },
    (1440, 3088, 3): {
        # 图片a 红蓝双方数据偏移
        "offsetX_a": 50.2,
        # 图片b 红蓝双方数据偏移
        "offsetX_b": 43.5,
        "offsetY_a": 117 / 476 * 100,
        # 图片b 红蓝双方数据偏移
        "offsetY_b": 172 / 828 * 100,
        "offsetY": 13.65,
        "A": [
            {"title": "head", "x": 168, "y": 287, "h": 100, "w": 100},
            {"title": "name", "x": 290, "y": 292, "h": 35, "w": 250},
            {"title": "out", "x": 290, "y": 350, "h": 35, "w": 170},
            {"title": "in", "x": 540, "y": 350, "h": 35, "w": 170},
            {"title": "frequency", "x": 795, "y": 350, "h": 35, "w": 170},
            {"title": "gold", "x": 1070, "y": 350, "h": 35, "w": 200},
        ],
        "B": [
            {"title": "kill", "x": 920, "y": 300, "h": 30, "w": 50},
            {"title": "die", "x": 993, "y": 300, "h": 30, "w": 50},
            {"title": "help", "x": 1068, "y": 300, "h": 30, "w": 50},
        ],
        "C": [
            {"title": "gameTime", "x": 450, "y": 78, "h": 30, "w": 150},
        ],
    },
    (1280, 2744, 3): {
        # 图片a 红蓝双方数据偏移
        "offsetX_a": 50.2,
        # 图片b 红蓝双方数据偏移
        # "offsetX_b":42,
        "offsetX_b": 43.5,
        "offsetY_a": 117 / 476 * 100,
        # 图片b 红蓝双方数据偏移
        "offsetY_b": 172 / 828 * 100,
        "offsetY": 13.65,
        "A": [
            {"title": "head", "x": 158, "y": 262, "h": 97, "w": 97},
            {"title": "name", "x": 276, "y": 264, "h": 35, "w": 250},
            {"title": "out", "x": 276, "y": 310, "h": 35, "w": 170},
            {"title": "in", "x": 506, "y": 310, "h": 35, "w": 170},
            {"title": "frequency", "x": 725, "y": 310, "h": 35, "w": 170},
            {"title": "gold", "x": 950, "y": 310, "h": 35, "w": 200},
        ],
        "B": [  # 1
            # {"title":'kill',"x":813,"y":263,"h":30,"w":50},
            # {"title":'die' ,"x":875,"y":263,"h":30,"w":50},
            # {"title":'help',"x":946,"y":263,"h":30,"w":50},
            # 已验证
            {"title": "kill", "x": 790, "y": 263, "h": 30, "w": 50},
            {"title": "die", "x": 855, "y": 263, "h": 30, "w": 50},
            {"title": "help", "x": 926, "y": 263, "h": 30, "w": 50},
        ],
        "C": [
            #  {"title":'gameTime',"x":443,"y":71,"h":30,"w":150},
            {"title": "gameTime", "x": 390, "y": 71, "h": 30, "w": 150},
        ],
    },
    (1080, 1546, 3): {
        # 图片a 红蓝双方数据偏移
        "offsetX_a": 50.2,
        # 图片b 红蓝双方数据偏移
        "offsetX_b": 47,  # 已验证
        "offsetY_a": 117 / 476 * 100,
        # 图片b 红蓝双方数据偏移
        "offsetY_b": 172 / 828 * 100,
        "offsetY": 14.9,
        "A": [
            {"title": "head", "x": 20, "y": 197, "h": 120, "w": 85},
            {"title": "name", "x": 103, "y": 197, "h": 40, "w": 200},
            {"title": "out", "x": 103, "y": 230, "h": 40, "w": 170},
            {"title": "in", "x": 247, "y": 230, "h": 40, "w": 170},
            {"title": "frequency", "x": 413, "y": 230, "h": 40, "w": 170},
            {"title": "gold", "x": 565, "y": 230, "h": 40, "w": 200},
        ],
        "B": [
            {"title": "kill", "x": 410, "y": 195, "h": 50, "w": 50},
            {"title": "die", "x": 459, "y": 195, "h": 50, "w": 50},
            {"title": "help", "x": 504, "y": 195, "h": 50, "w": 50},
        ],
        "C": [
            {"title": "gameTime", "x": 205, "y": 48, "h": 40, "w": 160},
        ],
    },
    (1280, 1833, 3): {
        # 图片a 红蓝双方数据偏移
        "offsetX_a": 50.2,
        # 图片b 红蓝双方数据偏移
        "offsetX_b": 47,  # 已验证
        "offsetY_a": 117 / 476 * 100,
        # 图片b 红蓝双方数据偏移
        "offsetY_b": 172 / 828 * 100,
        "offsetY": 14.9,
        "A": [
            {"title": "head", "x": 20 * 1.185, "y": 197 * 1.185, "h": 120, "w": 85},
            {"title": "name", "x": 103 * 1.185, "y": 197 * 1.185, "h": 40, "w": 200},
            {"title": "out", "x": 103 * 1.185, "y": 230 * 1.185, "h": 40, "w": 170},
            {"title": "in", "x": 247 * 1.185, "y": 230 * 1.185, "h": 40, "w": 170},
            {
                "title": "frequency",
                "x": 413 * 1.185,
                "y": 230 * 1.185,
                "h": 40,
                "w": 170,
            },
            {"title": "gold", "x": 565 * 1.185, "y": 230 * 1.185, "h": 40, "w": 200},
        ],
        "B": [
            {"title": "kill", "x": 410 * 1.185, "y": 195 * 1.185, "h": 50, "w": 50},
            {"title": "die", "x": 459 * 1.185, "y": 195 * 1.185, "h": 50, "w": 50},
            {"title": "help", "x": 504 * 1.185, "y": 195 * 1.185, "h": 50, "w": 50},
        ],
        "C": [
            {"title": "gameTime", "x": 205 * 1.185, "y": 48 * 1.185, "h": 40, "w": 160},
        ],
    },
    (1312, 2848, 3): {
        "offsetX_a": 50.2,
        "offsetX_b": 42.5,
        "offsetY_a": 24.579831932773107,
        "offsetY_b": 20.77294685990338,
        "offsetY": 13.65,
        "A": [
            {
                "title": "head",
                "x": 160.9384835479256,
                "y": 266.46821705426356,
                "h": 97,
                "w": 97,
            },
            {
                "title": "name",
                "x": 279.0958512160229,
                "y": 269.51937984496124,
                "h": 35,
                "w": 250,
            },
            {
                "title": "out",
                "x": 279.0958512160229,
                "y": 320.3720930232558,
                "h": 25,
                "w": 170,
            },
            {
                "title": "in",
                "x": 510.3175965665236,
                "y": 320.3720930232558,
                "h": 25,
                "w": 170,
            },
            {
                "title": "frequency",
                "x": 743.5765379113019,
                "y": 320.3720930232558,
                "h": 25,
                "w": 170,
            },
            {
                "title": "gold",
                "x": 947.2961373390558,
                "y": 320.3720930232558,
                "h": 25,
                "w": 200,
            },
        ],
        "B": [
            {
                "title": "kill",
                "x": 830.3433476394849,
                "y": 271.553488372093,
                "h": 30,
                "w": 50,
            },
            {
                "title": "die",
                "x": 896.552217453505,
                "y": 271.553488372093,
                "h": 30,
                "w": 50,
            },
            {
                "title": "help",
                "x": 969.8912732474964,
                "y": 271.553488372093,
                "h": 30,
                "w": 50,
            },
        ],
        "C": [
            {
                "title": "gameTime",
                "x": 440.92703862660943,
                "y": 71.1937984496124,
                "h": 30,
                "w": 200,
            }
        ],
    },
    (1280, 2844, 3): {
        # 图片a 红蓝双方数据偏移
        "offsetX_a": 50.2,
        # 图片b 红蓝双方数据偏移
        # "offsetX_b": 42,
        "offsetX_b": 43.5,
        "offsetY_a": 117 / 476 * 100,
        # 图片b 红蓝双方数据偏移
        "offsetY_b": 172 / 828 * 100,
        "offsetY": 13.65,
        "A": [
            {"title": "head", "x": 158, "y": 262, "h": 97, "w": 97},
            {"title": "name", "x": 276, "y": 264, "h": 35, "w": 250},
            {"title": "out", "x": 276, "y": 310, "h": 35, "w": 170},
            {"title": "in", "x": 506, "y": 310, "h": 35, "w": 170},
            {"title": "frequency", "x": 725, "y": 310, "h": 35, "w": 170},
            {"title": "gold", "x": 950, "y": 310, "h": 35, "w": 200},
        ],
        "B": [
            # 已验证
            {"title": "kill", "x": 813, "y": 263, "h": 40, "w": 50},
            {"title": "die", "x": 875, "y": 263, "h": 40, "w": 50},
            {"title": "help", "x": 946, "y": 263, "h": 40, "w": 50},
            # 已验证
            # {"title":'kill',"x":790,"y":263,"h":40,"w":50},
            # {"title":'die' ,"x":855,"y":263,"h":40,"w":50},
            # {"title":'help',"x":926,"y":263,"h":40,"w":50},
        ],
        "C": [
            # 已验证
            # {"title": "gameTime", "x": 443, "y": 71, "h": 30, "w": 150},
            {"title": "gameTime", "x": 409, "y": 71, "h": 30, "w": 150},
            #  {"title":'gameTime',"x":390,"y":71,"h":30,"w":150},
        ],
    },
    (1088, 2400, 3): {
        # 图片a 红蓝双方数据偏移
        "offsetX_a": 50.2,
        # 图片b 红蓝双方数据偏移
        # "offsetX_b":41.5, #已验证
        "offsetX_b": 43.5,  # 已验证
        # "offsetX_b":47, #已验证
        "offsetY_a": 117 / 476 * 100,
        # 图片b 红蓝双方数据偏移
        "offsetY_b": 172 / 828 * 100,
        "offsetY": 13.65,
        "A": [
            # 已验证
            {"title": "head", "x": 143, "y": 219, "h": 100, "w": 100},
            {"title": "name", "x": 245, "y": 220, "h": 40, "w": 250},
            {"title": "out", "x": 245, "y": 264, "h": 32, "w": 170},
            {"title": "in", "x": 442, "y": 264, "h": 32, "w": 170},
            {"title": "frequency", "x": 630, "y": 264, "h": 32, "w": 170},
            {"title": "gold", "x": 828, "y": 264, "h": 32, "w": 200},
        ],
        "B": [
            {"title": "kill", "x": 680, "y": 220, "h": 40, "w": 50},
            {"title": "die", "x": 739, "y": 220, "h": 40, "w": 50},
            {"title": "help", "x": 792, "y": 220, "h": 40, "w": 50},
            # {"title":'kill',"x":641,"y":220,"h":40,"w":50},
            # {"title":'die' ,"x":690,"y":220,"h":40,"w":50},
            # {"title":'help',"x":750,"y":220,"h":40,"w":50},
        ],
        "C": [  # 1
            #  {"title":'gameTime',"x":370,"y":59,"h":30,"w":160},
            {"title": "gameTime", "x": 330, "y": 59, "h": 30, "w": 160},
            #  {"title":'gameTime',"x":245,"y":57,"h":30,"w":160},
        ],
    },
    (751, 1679, 3): {
        # 图片a 红蓝双方数据偏移
        "offsetX_a": 50.2,
        # 图片b 红蓝双方数据偏移
        "offsetX_b": 42,  # 已验证
        "offsetY_a": 117 / 476 * 100,
        # 图片b 红蓝双方数据偏移
        "offsetY_b": 172 / 828 * 100,
        "offsetY": 13.65,
        "A": [
            {"title": "head", "x": 100, "y": 168, "h": 100, "w": 100},
            {"title": "name", "x": 179, "y": 171, "h": 40, "w": 250},
            {"title": "out", "x": 179, "y": 201, "h": 32, "w": 170},
            {"title": "in", "x": 323, "y": 201, "h": 32, "w": 170},
            {"title": "frequency", "x": 474, "y": 201, "h": 32, "w": 170},
            {"title": "gold", "x": 626, "y": 201, "h": 32, "w": 200},
        ],
        "B": [  # 已验证
            {"title": "kill", "x": 475, "y": 150, "h": 40, "w": 50},
            {"title": "die", "x": 517, "y": 150, "h": 40, "w": 50},
            {"title": "help", "x": 561, "y": 150, "h": 40, "w": 50},
        ],
        "C": [
            # 已验证
            {"title": "gameTime", "x": 240, "y": 38, "h": 30, "w": 160},
        ],
    },
    (1080, 1645, 3): {
        # 图片a 红蓝双方数据偏移
        "offsetX_a": 50.2,
        # 图片b 红蓝双方数据偏移
        "offsetX_b": 47,  # 已验证
        "offsetY_a": 117 / 476 * 100,
        # 图片b 红蓝双方数据偏移
        "offsetY_b": 172 / 828 * 100,
        "offsetY": 14.9,
        "A": [
            {"title": "head", "x": 20 * 1.06, "y": 197, "h": 120, "w": 85},
            {"title": "name", "x": 103 * 1.06, "y": 197, "h": 40, "w": 200},
            {"title": "out", "x": 103 * 1.06, "y": 230, "h": 40, "w": 170},
            {"title": "in", "x": 247 * 1.06, "y": 230, "h": 40, "w": 170},
            {"title": "frequency", "x": 413 * 1.06, "y": 230, "h": 40, "w": 170},
            {"title": "gold", "x": 565 * 1.06, "y": 230, "h": 40, "w": 200},
        ],
        "B": [
            {"title": "kill", "x": 410 * 1.06, "y": 195, "h": 50, "w": 50},
            {"title": "die", "x": 459 * 1.06, "y": 195, "h": 50, "w": 50},
            {"title": "help", "x": 504 * 1.06, "y": 195, "h": 50, "w": 50},
        ],
        "C": [
            {"title": "gameTime", "x": 205 * 1.06, "y": 48, "h": 40, "w": 160},
        ],
    },
    (1080, 1728, 3): {
        # 图片a 红蓝双方数据偏移
        "offsetX_a": 50.2,
        # 图片b 红蓝双方数据偏移
        # "offsetX_b": 47,  # 已验证
        "offsetX_b": 47,  # 已验证
        "offsetY_a": 117 / 476 * 100,
        # 图片b 红蓝双方数据偏移
        "offsetY_b": 172 / 828 * 100,
        "offsetY": 14.3,
        "A": [
            {"title": "head", "x": 22 * 1.06 * 1.0504, "y": 210, "h": 120, "w": 85},
            {"title": "name", "x": 105 * 1.06 * 1.0504, "y": 210, "h": 40, "w": 200},
            {"title": "out", "x": 105 * 1.06 * 1.0504, "y": 250, "h": 40, "w": 170},
            {"title": "in", "x": 247 * 1.06 * 1.0504, "y": 250, "h": 40, "w": 170},
            {
                "title": "frequency",
                "x": 413 * 1.06 * 1.0504,
                "y": 250,
                "h": 40,
                "w": 170,
            },
            {"title": "gold", "x": 565 * 1.06 * 1.0504, "y": 250, "h": 40, "w": 200},
        ],
        "B": [
            {"title": "kill", "x": 410 * 1.06 * 1.0504, "y": 205, "h": 50, "w": 50},
            {"title": "die", "x": 459 * 1.06 * 1.0504, "y": 205, "h": 50, "w": 50},
            {"title": "help", "x": 504 * 1.06 * 1.0504, "y": 205, "h": 50, "w": 50},
        ],
        "C": [
            {"title": "gameTime", "x": 205 * 1.06 * 1.0504, "y": 55, "h": 40, "w": 160},
        ],
    },
    (1116, 2480, 3): {
        "offsetX_a": 50.2,
        # "offsetX_b": 43.5,
        "offsetX_b": 47,
        "offsetY_a": 24.579831932773107,
        "offsetY_b": 20.77294685990338,
        "offsetY": 13.65,
        "A": [
            {
                "title": "head",
                "x": 151.77777777777777,
                "y": 226.43125,
                "h": 100,
                "w": 100,
            },
            {"title": "name", "x": 245.67510548523208, "y": 230.175, "h": 35, "w": 250},
            {
                "title": "out",
                "x": 246.67510548523208,
                "y": 270.28125,
                "h": 35,
                "w": 170,
            },
            {"title": "in", "x": 449.2376933895921, "y": 270.28125, "h": 35, "w": 170},
            {
                "title": "frequency",
                "x": 650.2081575246132,
                "y": 270.28125,
                "h": 35,
                "w": 170,
            },
            {
                "title": "gold",
                "x": 855.4106891701829,
                "y": 270.28125,
                "h": 35,
                "w": 200,
            },
        ],
        "B": [
            {
                "title": "kill",
                # "x": 708.9451476793249,
                "x": 658.9451476793249,
                "y": 229.303125,
                "h": 40,
                "w": 50,
            },
            {
                "title": "die",
                #  "x": 763.0098452883263,
                "x": 713.0098452883263,
                "y": 229.303125,
                "h": 40,
                "w": 50,
            },
            {
                "title": "help",
                # "x": 824.9226441631505,
                "x": 775.9226441631505,
                "y": 229.303125,
                "h": 40,
                "w": 50,
            },
        ],
        "C": [
            {
                "title": "gameTime",
                "x": 265.6526019690577,
                "y": 61.903125,
                "h": 30,
                "w": 150,
            }
        ],
    },
    (847, 1920, 3): {
        # 图片a 红蓝双方数据偏移
        "offsetX_a": 50.2,
        # 图片b 红蓝双方数据偏移
        "offsetX_b": 44,  # 已验证
        "offsetY_a": 117 / 476 * 100,
        # 图片b 红蓝双方数据偏移
        "offsetY_b": 172 / 828 * 100,
        "offsetY": 13.65,
        "A": [
            {"title": "head", "x": 125, "y": 169, "h": 100, "w": 100},
            {"title": "name", "x": 198, "y": 174, "h": 40, "w": 250},
            {"title": "out", "x": 201, "y": 206, "h": 32, "w": 170},
            {"title": "in", "x": 354, "y": 206, "h": 32, "w": 170},
            {"title": "frequency", "x": 506, "y": 206, "h": 32, "w": 170},
            {"title": "gold", "x": 656, "y": 206, "h": 32, "w": 200},
        ],
        "B": [  # 已验证
            {"title": "kill", "x": 547, "y": 173, "h": 40, "w": 50},
            {"title": "die", "x": 582, "y": 173, "h": 40, "w": 50},
            {"title": "help", "x": 635, "y": 173, "h": 40, "w": 50},
        ],
        "C": [
            # 已验证
            {"title": "gameTime", "x": 256, "y": 38, "h": 30, "w": 160},
        ],
    },
    (1488, 2266, 3): {
        "offsetX_a": 50.2,
        "offsetX_b": 47,
        "offsetY_a": 24.579831932773107,
        "offsetY_b": 20.77294685990338,
        "offsetY": 14.5,
        "A": [
            {
                "title": "head",
                "x": 32.203161094224928,
                "y": 281.4222222222222,
                "h": 120,
                "w": 85,
            },
            {
                "title": "name",
                "x": 150.39627963525837,
                "y": 285.4222222222222,
                "h": 40,
                "w": 200,
            },
            {
                "title": "out",
                "x": 150.39627963525837,
                "y": 330.8888888888889,
                "h": 40,
                "w": 170,
            },
            {
                "title": "in",
                "x": 360.6590395136778,
                "y": 330.8888888888889,
                "h": 40,
                "w": 170,
            },
            {
                "title": "frequency",
                "x": 603.0452765957448,
                "y": 330.8888888888889,
                "h": 40,
                "w": 170,
            },
            {
                "title": "gold",
                "x": 824.989300911854,
                "y": 330.8888888888889,
                "h": 40,
                "w": 200,
            },
        ],
        "B": [
            {
                "title": "kill",
                "x": 598.664802431611 + 15,
                "y": 280.6666666666667,
                "h": 50,
                "w": 50,
            },
            {
                "title": "die",
                "x": 670.2125471124621,
                "y": 280.6666666666667,
                "h": 50,
                "w": 50,
            },
            {
                "title": "help",
                "x": 735.9196595744681,
                "y": 280.6666666666667,
                "h": 50,
                "w": 50,
            },
        ],
        "C": [
            {
                "title": "gameTime",
                "x": 299.3324012158055,
                "y": 66.13333333333334,
                "h": 40,
                "w": 160,
            }
        ],
    },
    (864, 1920, 3): {
        # 图片a 红蓝双方数据偏移
        "offsetX_a": 50.2,
        # 图片b 红蓝双方数据偏移
        "offsetX_b": 44,  # 已验证
        "offsetY_a": 117 / 476 * 100,
        # 图片b 红蓝双方数据偏移
        "offsetY_b": 172 / 828 * 100,
        "offsetY": 13.65,
        "A": [
            {"title": "head", "x": 117, "y": 171 * 1.02, "h": 100, "w": 100},
            {"title": "name", "x": 198, "y": 174 * 1.02, "h": 40, "w": 250},
            {"title": "out", "x": 201, "y": 206 * 1.02, "h": 32, "w": 170},
            {"title": "in", "x": 354, "y": 206 * 1.02, "h": 32, "w": 170},
            {"title": "frequency", "x": 506, "y": 206 * 1.02, "h": 32, "w": 170},
            {"title": "gold", "x": 656, "y": 206 * 1.02, "h": 32, "w": 200},
        ],
        "B": [  # 已验证
            {"title": "kill", "x": 547, "y": 173 * 1.02, "h": 40, "w": 50},
            {"title": "die", "x": 582, "y": 173 * 1.02, "h": 40, "w": 50},
            {"title": "help", "x": 635, "y": 173 * 1.02, "h": 40, "w": 50},
        ],
        "C": [
            # 已验证
            {"title": "gameTime", "x": 265, "y": 47, "h": 30, "w": 160},
        ],
    },
    (592, 1280, 3): {
        "offsetX_a": 50.2,
        "offsetX_b": 42,
        "offsetY_a": 24.579831932773107,
        "offsetY_b": 20.77294685990338,
        "offsetY": 13.65,
        "A": [
            {
                "title": "head",
                "x": 70.9480122324159,
                "y": 120.64686468646865,
                "h": 100,
                "w": 100,
            },
            {
                "title": "name",
                "x": 127.70642201834862,
                "y": 119.66996699669967,
                "h": 35,
                "w": 250,
            },
            {
                "title": "out",
                "x": 127.70642201834862,
                "y": 144.0924092409241,
                "h": 35,
                "w": 170,
            },
            {
                "title": "in",
                "x": 229.96941896024464,
                "y": 144.0924092409241,
                "h": 35,
                "w": 170,
            },
            {
                "title": "frequency",
                "x": 337.61467889908255,
                "y": 144.0924092409241,
                "h": 35,
                "w": 170,
            },
            {
                "title": "gold",
                "x": 447.70642201834863,
                "y": 144.0924092409241,
                "h": 35,
                "w": 200,
            },
        ],
        "B": [
            {
                "title": "kill",
                "x": 370.9724770642202,
                "y": 122.11221122112211,
                "h": 40,
                "w": 50,
            },
            {
                "title": "die",
                "x": 403.77675840978594,
                "y": 122.11221122112211,
                "h": 40,
                "w": 50,
            },
            {
                "title": "help",
                "x": 437.0489296636086,
                "y": 122.11221122112211,
                "h": 40,
                "w": 50,
            },
        ],
        "C": [
            {
                "title": "gameTime",
                "x": 200.93272171253824,
                "y": 31.74917491749175,
                "h": 30,
                "w": 150,
            }
        ],
    },
    (1080, 1440, 3): {
        # 图片a 红蓝双方数据偏移
        "offsetX_a": 50.2,
        # 图片b 红蓝双方数据偏移
        "offsetX_b": 47,  # 已验证
        "offsetY_a": 117 / 476 * 100,
        # 图片b 红蓝双方数据偏移
        "offsetY_b": 172 / 828 * 100,
        "offsetY": 15.2,
        "A": [
            {"title": "head", "x": 20, "y": 190, "h": 123, "w": 75},
            {"title": "name", "x": 93, "y": 194, "h": 40, "w": 200},
            {"title": "out", "x": 89, "y": 225, "h": 40, "w": 170},
            {"title": "in", "x": 217, "y": 223, "h": 40, "w": 170},
            {"title": "frequency", "x": 380, "y": 223, "h": 40, "w": 170},
            {"title": "gold", "x": 525, "y": 223, "h": 40, "w": 200},
        ],
        "B": [
            {"title": "kill", "x": 390, "y": 195, "h": 50, "w": 40},
            {"title": "die", "x": 429, "y": 195, "h": 50, "w": 40},
            {"title": "help", "x": 475, "y": 195, "h": 50, "w": 40},
        ],
        "C": [
            {"title": "gameTime", "x": 190, "y": 45, "h": 40, "w": 160},
        ],
    },
}

# print(config_data)
# cutMap = json.loads(HOCONConverter.to_json(config_data))


# 识别结果转excel格式
def renderExcel(obj):
    excelArr = [
        {"title": "裁判", "key": "referee"},
        {"title": "所属战队", "key": "team"},
        {"title": "队员id", "key": "name"},
        {"title": "使用英雄", "key": "head"},
        # {"title": "英雄", "key": "headImage1", "type": "img"},
        {"title": "经济", "key": "gold"},
        # {"title": "经济占比", "key": "goldProgress"},
        {"title": "对位经济差", "key": "gap"},
        {"title": "击杀", "key": "kill"},
        {"title": "助攻", "key": "help"},
        # {"title": "死亡", "key": "die"},
        {"title": "输出", "key": "out"},
        # {"title": "输出占比", "key": "outProgress"},
        {"title": "承伤", "key": "in"},
        {"title": "参团次数", "key": "frequency"},
        # {"title": "参团占比", "key": "frequencyProgress"},
        {"title": "游戏时间", "key": "gameTime"},
    ]
    data = []
    title = []
    # print(obj)
    for r in range(0, 2):
        for i in range(0, 5):
            arr = []
            for a in excelArr:
                if r == 0 and i == 0:
                    title.append(a["title"])
                if r == 0 and i == 0 and (a["key"] == "gameTime"):
                    arr.append(obj.get("gameTime"))
                    # or a["key"]=='team'
                    # arr.append(obj.get('team'))
                    break

                # print(r,a["key"],i)
                # if(a["key"]=='team'):
                #    arr.append(obj.get('team'))
                #    break;
                # if(a["key"]=='gameTime'):
                #   arr.append(obj.get('gameTime'))
                #   break;
                key = "{}_{}_{}".format(r, a["key"], i)
                # print(key)
                if a["key"] == "team":
                    arr.append(obj.get("team"))
                elif a["key"] == "referee":
                    arr.append(obj.get("referee"))
                else:
                    # print(key,obj.get(key))
                    arr.append(obj.get(key))
                # arr.append(obj.get('team'))
            # print(arr)
            data.append(arr)
            # print(data)
    return {"data": data, "title": title}


# 计算切片偏移


def computedCup(item, px, py, n, i, offsetX, offsetY):
    # print(item, px, py, n, i, offsetX,offsetY)
    # print("x基础百分比", item["x"])
    # print("队伍偏移", n * offsetX)
    # print("x百分比", (item["x"] + n * offsetX) / 100)
    # print("x总长度", px)
    # print("x结果", (item["x"] + n * offsetX) / 100 * px)
    offsetBase = 1
    # x偏移
    startx = round((item["x"] / px * 100 + n * offsetX) / 100 * px * offsetBase)
    # y偏移 计算  第一行的内容+偏移*行 /100 计算
    starty = round(((item["y"] / py * 100 + i * offsetY) / 100) * py * offsetBase)
    # print('X比=>',startx)
    # print(startx,starty)
    h = round(item["h"] / 2532 * px * offsetBase)
    w = round(item["w"] / 1170 * py * offsetBase)
    # print(h,w)
    return [startx, starty, h, w]


# 写入excel
def writeExcel(obj):
    # print('写入之前======',obj)
    def highlight_first_row(s):
        # print('高亮函数',s)
        arr = []
        isColor = False
        for v in range(0, len(s)):
            if v % 10 == 0:
                isColor = not isColor
            arr.append("background-color: yellow" if isColor else "")
        return arr
        # return 'background-color: green;color:red'

    def color_negative_red(val):
        color = "red" if val.find("%") > -1 else "black"
        return "color: %s" % color

    df = pd.read_excel(file_path, sheet_name="Sheet1")  #
    result = renderExcel(obj)
    # print(result)
    data = result["data"]
    title = result["title"]
    if not df.empty:
        for i in range(0, len(data)):
            print(data[i])
            df.loc[len(df)] = data[i]
        # print(df.loc[df.index])
        # resultData = DataFrame(df)
        # print(resultData.style)
        # resultData.apply(highlight_first_row,axis=1)
        # style
        # df.\
        #   style.apply(color_negative_red,axis=1)
        # df.style.hide(axis=0,level=0)
        style_df = df.style.apply(highlight_first_row, axis=0)
        # resultData.style.background_gradient()
        # resultData.style.background_gradient(cmap='Blues',gmap=resultData['击杀'])
        # resultData.style.background_gradient(cmap='gray_r')
        # writer = pd.ExcelWriter(file_path)
        style_df.to_excel(file_path, sheet_name="Sheet1", index=False, header=True)
        # print(df)
    else:
        DataFrame(data, range(0, len(data)), title).to_excel(
            file_path, sheet_name="Sheet1", index=False, header=True
        )
        # df.append()
        # DataFrame(data).to_excel(file_path, sheet_name='Sheet1', index=False, header=True)


# 切片
def cut(img, img2):
    # 图片宽度
    py = img.shape[0]
    # 图片长
    px = img.shape[1]
    py2 = img2.shape[0]
    px2 = img2.shape[1]
    # 图片a 红蓝双方数据偏移
    # offsetX_a=50.2
    # # 图片b 红蓝双方数据偏移
    # offsetX_b=42
    # # 基础 每行便宜
    # offsetY = 13.65
    # # 图片a 每行高度偏移
    # numberOffsetY = 117 / 476 * 100
    # # 图片b 每行高度偏移
    # numberOffsetYB = 172 / 828 * 100
    print("输入的图片1分辨率++++++++++++++", px, py)
    print("输入的图片2分辨率++++++++++++++", px2, py2)
    # 图一模板
    img_arr = [img, img2]
    # 图12 切不切 默认不切
    state_cut_1 = False
    state_cut_2 = False
    #     if(i==0):
    #   notCut1 = True
    # elif(i==1):
    #   notCut2 = True
    for i in range(0, len(img_arr)):
        #  print(img)
        print("img_item", img_arr[i].shape)
        if not img_arr[i].shape in cutMap:
            print("没有这个分辨率")
            reat = img_arr[i].shape[0] / img_arr[i].shape[1]
            for item in list(cutMap.keys()):
                if "{:.3f}".format(reat) == "{:.3f}".format(item[0] / item[1]):
                    if i == 0:
                        state_cut_1 = True
                    elif i == 1:
                        state_cut_2 = True
                    cutMap.update({img_arr[i].shape: cutMap[item]})
                    for aitem in cutMap[img_arr[i].shape]["A"]:
                        aitem["x"] = aitem["x"] * img_arr[i].shape[1] / item[1]
                        aitem["y"] = aitem["y"] * img_arr[i].shape[0] / item[0]
                    for bitem in cutMap[img_arr[i].shape]["B"]:
                        bitem["x"] = bitem["x"] * img_arr[i].shape[1] / item[1]
                        bitem["y"] = bitem["y"] * img.shape[0] / item[0]
                    for citem in cutMap[img_arr[i].shape]["C"]:
                        citem["x"] = citem["x"] * img_arr[i].shape[1] / item[1]
                        citem["y"] = citem["y"] * img_arr[i].shape[0] / item[0]
                    print(cutMap[img_arr[i].shape])
                    is_similitude = True
                    # break;
                else:
                    if i == 0:
                        state_cut_1 = False
                    elif i == 1:
                        state_cut_2 = False
        else:
            if i == 0:
                state_cut_1 = True
            elif i == 1:
                state_cut_2 = True
        # if(not is_similitude):
    #     print('没有相似的')

    if not state_cut_1:
        cutM = cutMap[(1280, 2844, 3)]
    else:
        cutM = cutMap[img.shape]
    if not state_cut_2:
        cutMB = cutMap[(1280, 2844, 3)]
    else:
        cutMB = cutMap[img2.shape]
    # cutM = cutMap[img.shape]
    offsetX_a = cutM["offsetX_a"]
    offsetY_a = cutM["offsetY_a"]
    offsetYA = cutM["offsetY"]
    cutSheepA = cutM["A"]
    # 图二模板

    offsetX_b = cutMB["offsetX_b"]
    offsetY_b = cutMB["offsetY_b"]
    offsetYB = cutMB["offsetY"]
    cutSheepB = cutMB["B"]
    cutSheepC = cutMB["C"]
    # print(cutM)
    # print(state_cut_1,state_cut_2)
    # cutSheepA = [
    #     {"title": "head", "x": 5.7, "y": 20.4, "h": 97, "w": 97},
    #     {"title":'name',"x":103/1028*100,"y":98/476*100,"h":35,"w":200},
    #     {"title":'out',"x":103/1028*100,"y":numberOffsetY,"h":25,"w":170},
    #     {"title":'in',"x":186/1028*100,"y":numberOffsetY,"h":25,"w":170},
    #     {"title":'frequency',"x":270/1028*100,"y":numberOffsetY,"h":25,"w":170},
    #     {"title":'gold',"x":355/1028*100,"y":numberOffsetY,"h":25,"w":200}
    #     ]
    # cutSheepB = [
    #     {"title":'kill',"x":29.4,"y":numberOffsetYB,"h":30,"w":50},
    #     {"title":'die' ,"x":32,"y":numberOffsetYB,"h":30,"w":45},
    #     {"title":'help',"x":34.3,"y":numberOffsetYB,"h":30,"w":45},
    # ]
    print("开始切图++++++")
    print("图A切不切？", state_cut_1)
    print("图B切不切？", state_cut_2)
    print(img.shape, img2.shape)
    # if img.shape[0] != img2.shape[0] or img.shape[1] != img2.shape[1]:
    #     print("两张图分辨率不同,切图停止")
    #     return
    # 队伍 红蓝
    obj = {}
    obj["ocr_0"] = True
    obj["ocr_1"] = True
    print("识别之前", obj)
    for n in range(0, 2):
        # print(n)
        # 队伍 字段配置
        for a in cutSheepA:
            # 人员 0-4
            for i in range(0, 5):
                fileName = str(n) + "_" + a["title"] + "_" + str(i)
                obj[fileName] = ""
                if not state_cut_1:
                    # print('a不需要识别')
                    obj["ocr_0"] = False
                    continue
                startx, starty, h, w = computedCup(a, px, py, n, i, offsetX_a, offsetYA)
                cropped = img[
                    starty : starty + h, startx : startx + w
                ]  # 裁剪坐标为[y0:y1, x0:x1]
                # print(starty+h,startx+w)

                path = basePath + "/data/cut/{}.png".format(fileName)
                # path = "/py_api/lol_m_ocr/data/cut/{}.png".format(fileName)
                # path = "/py_api/lol_m_ocr/data"
                # print(path)
                cv2.imwrite(path, cropped)
                # print(c["title"].find('head'))
                if a["title"].find("head") > -1:
                    circle.circle(path, path)
        for b in cutSheepB:
            for i in range(0, 5):
                fileName = str(n) + "_" + b["title"] + "_" + str(i)
                obj[fileName] = ""
                if not state_cut_2:
                    # print('b不需要识别')
                    obj["ocr_1"] = False
                    continue
                startx, starty, h, w = computedCup(
                    b, px2, py2, n, i, offsetX_b, offsetYB
                )
                cropped = img2[starty : starty + h, startx : startx + w]
                # 裁剪坐标为[y0:y1, x0:x1]
                path = basePath + "/data/cut/{}.png".format(fileName)

                cv2.imwrite(path, cropped)
    for c in cutSheepC:
        fileName = c["title"]
        obj[fileName] = ""
        if not state_cut_2:
            obj["ocr_1"] = False
            continue
        startx, starty, h, w = computedCup(c, px2, py2, 0, 0, offsetX_b, offsetYB)
        # print("startx, starty, h, w ", startx, starty, h, w)
        cropped = img2[starty : starty + h, startx : startx + w]
        path = basePath + "/data/cut/{}.png".format(fileName)
        # print(fileName)
        cv2.imwrite(path, cropped)
    print("切图完成!++++++++++++++")
    # print(obj)
    return obj


# 单独识别
def ocr(key, type=False):
    img_fp = basePath + "/data/cut/" + key + ".png"
    out = ""

    if type:
        out = text_ocr.ocr_for_single_line(img_fp)
    else:
        out = number_ocr.ocr_for_single_line(img_fp)
    # print(out)
    return out

def cv_imread(file_path):
    cv_img = cv2.imdecode(np.fromfile(file_path,dtype=np.uint8),-1)
    return cv_img

# 列表识别
def ocrList(obj, hasHead=True):
    for i in list(obj.keys()):
        arr_a = ["head", "name", "out", "in", "frequency", "gold", 0]
        arr_b = ["help", "die", "kill", 1]
        # obj['ocr_0']=False
        print(i)

        if i != "gameTime":
            # print(obj['ocr_1'],i,i.split('_')[1])
            if i.split("_")[0] == "ocr":
                continue
            if not obj["ocr_0"] and i.split("_")[1] in arr_a:
                continue
            if not obj["ocr_1"] and i.split("_")[1] in arr_b:
                continue
        # print(obj['ocr_0'],obj['ocr_1'],'进入识别了',i)

        if i.find("_head_") > -1 and hasHead:
            url = basePath + "/data/cut/{}.png".format(i)
            with open(url,"rb") as f:#转为二进制格式
              obj["image_"+i] = base64.b64encode(f.read()).decode('utf-8')#使用base64进行加密
            result = ocrHead(url)
            # print(result)
            obj[i] = result["name"]
            imgKey = i.replace("_head_", "_headImage_")
            # print(img)
            # obj[imgKey]={'x': 100, 'y': 100, 'image':[img]}
            # img = np.array(Image.open(url))
            # obj[imgKey]=img
            # print()
            # obj[i.replace('_head_','_headImg_')]=
        else:
            with open(basePath + "/data/cut/{}.png".format(i),"rb") as f:#转为二进制格式
                obj["image_"+i] = base64.b64encode(f.read()).decode('utf-8')#使用base64进行加密
            if (
                i.find("_gold_") > -1
                or i.find("_frequency_") > -1
                or i.find("_out_") > -1
            ):
                # obj[i] =
                currentOcr = ocr(i)["text"]
                # while(currentOcr.find('|')==-1 or currentOcr.find(' ')==-1):
                #     currentOcr = ocr(i)["text"]
                result = formatProgress(currentOcr)
                obj[i] = result["text"]
            else:
                obj[i] = ocr(i, i.find("_name_") > -1)["text"]


def formatProgress(str):
    index = str.find("|")
    text = None
    progress = None
    if index > -1:
        text = str.split("|")[0].strip()
        progress = str.split("|")[1].strip()
    elif str.rfind("i") > -1:
        text = str.split("i")[0].strip()
        progress = str.split("i")[1].strip()
    elif str.rfind("I") > -1:
        text = str.split("I")[0].strip()
        progress = str.split("I")[1].strip()
    # elif(len(find_all(str,' '))==2):

    #     str = str.strip()
    #     resultArr = find_all(str,'1')
    #     for i in resultArr:
    #         text =  str[0:i]
    #         progress = str[i+1:len(str)-1]
    #         if(progress)
    else:
        text = str
    # 又空格直接取掉空格 取掉之后看
    # elif(str.find('%')>-1 and str.find(' ')>-1 ):
    #     text = str.split(' ')[0].strip()
    #     progress = str.split(' ')[1].strip()
    #     if(text[len(text)==1]):
    #         print('text',text,len(text))
    #         text = text[0:len(text)-1]
    #     else:
    #         progress = progress[1:len(text)]
    # # 小与百分之一百
    # elif(str.find('%')>-1 and int(str[-3])==1 and int(str[-4])!=1 ):
    #     str[-3]
    #     text= str
    # # 可能是百分之百
    # elif(str.find('%')>-1 and int(str[-4])==1 and int(str[-3])!=1  ):
    #     text= str
    # #   str = str.replace('|',',')
    # # text = str
    # print('text',text)
    obj = {
        "text": text,
        "progress": progress,
    }
    return obj


# 头像识别
def ocrHead(path):
    with open(basePath + "/downloadhead/heroList.json", "r", encoding="utf-8") as f:
        model = json.load(f)
        heroList = model["heroList"]
        # print(len(heroList))
        currentPath = basePath + "/downloadhead/circleAvatar/"
        arr = []
        for i in heroList:
            name = heroList[i]["name"]
            title = heroList[i]["title"]
            roles = heroList[i]["roles"]
            defUrl = "{}/{}.png".format(currentPath, name)
            # print()
            # print(i['name'])
            # print(path, defUrl)
            # cv_imread()
            # result = defImag.main(path, defUrl)
            # print(path,defUrl)
            # print('头像对比开始')
            result = defImag.main_img(cv_imread(path), cv_imread(defUrl))
            # print('头像对比结束')
            result["name"] = name
            result["title"] = title
            result["roles"] = roles
            arr.append(result)
            # if(result['cmpHashResult']>0.5 and result['classifyResult']>0.5):
            #     print(result)
            #     print(name)
            # print(result["path1"])
            # print(result)
        max_age_person = max(
            arr,
            key=lambda i: i["acmpHashResult"]
            + i["dcmpHashResult"]
            + i["pcmpHashResult"]
            + i["calculateResult"]
            + i["classifyResult"],
        )
        return max_age_person
        # for i in arr:
        # print(i)
        # print(max_age_person)


def getFileList(inPaht, fun):
    files = os.listdir(inPaht)
    if len(files) % 2 != 0:
        print("图片数量不是偶数，停止操作")
        return
    print(files)
    for file in files:
        print(file)
        # if(i%2==0):
        #     print(i)


def find_all(string, sub):
    start = 0
    pos = []
    while True:
        start = string.find(sub, start)
        if start == -1:
            return pos
        pos.append(start)
        start += len(sub)


# 检查图片顺序；
def judgement_img_type(img1, img2):
    result = []
    for i in [img2, img1]:
        x_start = int(i.shape[0] * 0.01)
        x_end = int(i.shape[0] * 0.05)
        y_end = int(i.shape[1] * 0.2)
        cropped = i[x_start:x_end, 0:y_end]
        # print(cropped)
        cv2.imwrite("./data/cut/{}.png".format(1), cropped)
        img_out = text_ocr.ocr_for_single_line(cropped)
        result.append(img_out)
    return result


def finalTreatment(obj):
    for i in obj:
        if (
            (
                i.find("_gold_") > -1
                or i.find("_frequency_") > -1
                or i.find("_out_") > -1
            )
            and obj[i] != None
            and obj[i].find("%") > -1
        ):
            start_ = i.find("_")
            last_ = i.rfind("_")
            # 开头
            startNum = i[0:start_]
            # 结尾
            endNum = i[last_ + 1 : len(i)]
            # 中间
            centerStr = i[start_ + 1 : last_]
            obj[i] = obj[i].strip()
            print(i, obj[i])
            resultArr = find_all(obj[i], "1")
            baseConputed = 0
            currentValue = obj[i]
            # 取出基准值
            for number in range(0, 4):
                if (
                    endNum != number
                    and baseConputed == 0
                    and obj["{}_{}_{}".format(startNum, centerStr, number)].find("%")
                    == -1
                ):
                    baseConputed = obj["{}_{}_{}".format(startNum, centerStr, number)]
                    break
            # 有基准值 并且有1 校验
            print(resultArr, baseConputed)
            print("基准值", baseConputed)
            if len(resultArr) > 0 and baseConputed:
                for num in resultArr:
                    str = currentValue[0:num]
                    progress = currentValue[num : 4 + 1 : len(currentValue) - 1]
                    print("progress", progress)
                    if (
                        progress == ""
                        or int(progress) > 100
                        or (int(progress) < 0)
                        or str == ""
                        or (int(str) < 0)
                    ):
                        print("i>100", num, str)
                    else:
                        print("我准备修改结果为", str)
                        print(i)
                        obj[i] = str
                        break


# def main():
#     mainPath = basePath+'/data/origin/BMW7.22赛果/裁判1'
#     team = '/B588 VS B424'
#     path1 = '{}{}/'.format(mainPath,team)
#     imgName1 ='bad217b7f9283eb17b3895b6119221d'
#     imgName2 ='945f514480d1d999642b9fb67bf8bca'
#     type1= 'jpg'
#     type2= 'png'
#     imgurl1 = '{}.{}'.format(imgName1,type1)
#     imgurl2 = '{}.{}'.format(imgName2,type1)
#     isOut=1
#     print("mainRun!")
#     print(path1,imgurl1)
#     print(path1,imgurl2)
#     # 1242 2688
#     img = cv_imread("{}{}".format(path1,imgurl1))
#     img2 = cv_imread("{}{}".format(path1,imgurl2))
#     obj = cut(img, img2)
#     if(isOut):
#       ocrList(obj)
#       obj['team'] = team
#       print(obj)
#       # writeExcel(obj)
def branch_remote(img1_file_name, img2_file_name):
    print("main接到了", img1_file_name, img2_file_name)
    # webPath = '../../../node/wdAPI/data/uploads/'
    # webPath = "../../node/wdAPI/data/uploads/"
    webPath = "//192.168.50.2/docker/node/wdAPI/data/uploads/"
    url1 = "{}{}".format(webPath, img1_file_name)
    url2 = "{}{}".format(webPath, img2_file_name)
    team = None
    print(url2)
    img = cv_imread(url1)
    img2 = cv_imread(url2)
    return [img, img2]


# def image2Base64(url):
    
   
#       print(base64_data)
#       return base64_data
      # file=open('1.txt','wt')#写成文本格式
      # file.write(base64_data)
      # file.close()

# 1111
def main(img1_file_name=None, img2_file_name=None):
    isOutObj = 1
    imgArr = []
    isOut = 1
    # print(cutMap)
    if not img1_file_name or not img2_file_name:
        print("进入if 取本地图片")
        isOutObj = 0
        type1 = "jpg"
        type2 = "png"
        print("mainRun!")
        # mainPath = basePath + "/data/origin/BMW7.22赛果/裁判3"

        mainPath = basePath + "/data/origin/BMW9.2 9.3赛果"
        referee = "/9.3"
        team = "/P166 vs B489"
        # 直接结束
        if 0:
            obj = {}
            obj["team"] = team
            obj["referee"] = referee
            writeExcel(obj)
            return
        imgName1 = "5bc73c760e9a18ef2e962d5079d5aa5"
        imgName2 = "0358f1231ca5b2e3c5509c51f4045c8"
        isOut = 0
        # 图片名称
        imgurl1 = "{}.{}".format(imgName1, type1)
        imgurl2 = "{}.{}".format(imgName2, type1)
        # 前面路径
        path1 = "{}{}{}/".format(mainPath, referee, team)
        img = cv_imread("{}{}".format(path1, imgurl1))
        img2 = cv_imread("{}{}".format(path1, imgurl2))
        imgArr = [img, img2]
    else:
        imgArr = branch_remote(img1_file_name, img2_file_name)
    print("结束if")
    img = imgArr[0]
    img2 = imgArr[1]
    judgement_result = judgement_img_type(img, img2)
    print(judgement_result)
    # a面统计 b面征召
    if (
        judgement_result[0]["text"].find("征召") > -1
        or judgement_result[1]["text"].find("统计") > -1
    ):
        obj = cut(img, img2)
    elif (
        judgement_result[0]["text"].find("统计") > -1
        or judgement_result[1]["text"].find("征召") > -1
    ):
        obj = cut(img2, img)
    else:
        obj = cut(img2, img)
    if isOut:
        ocrList(obj)
        # print("isOutObj", isOutObj)

        # finalTreatment(obj)
        # print(obj)
        if isOutObj:
            print("接口返回")
            return obj
        else:
            obj["team"] = team
            obj["referee"] = referee
            print("写入本地")
            writeExcel(obj)
        # print(obj)
        #


print(__name__)


def ocr_all():
    isOutObj = False
    mainPath = basePath + "/data/origin/BMW8.26 8.27赛果/裁判1"
    team = "/B213 vs B077"
    path1 = "{}{}/".format(mainPath, team)
    imgName1 = "6c399c3693ff1d8da74f2c98dc2010b"
    imgName2 = "72b4a5d58960f44e5c6a9a8d57fa289"

    type1 = "jpg"
    type2 = "png"
    isOut = 0
    imgurl1 = "{}.{}".format(imgName1, type1)
    imgurl2 = "{}.{}".format(imgName2, type1)
    print("mainRun!")
    img = cv_imread("{}{}".format(path1, imgurl1))
    img2 = cv_imread("{}{}".format(path1, imgurl2))
    # out = all_ocr_.ocr(img)
    out2 = all_ocr_.ocr(
        img2, rec_batch_size=10, min_box_size=10, return_cropped_image=True
    )
    print(out2)


if "__main__" == __name__:
    from split import def_image as defImag
    from split import circle

    basePath = "."
    main()
    # ocr_all()
else:
    from .split import def_image as defImag
    from .split import circle

    basePath = "./lol_m_ocr"
